<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [38]:
import sqlite3
import pandas as pd

In [39]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [40]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [41]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)

In [42]:
data.to_sql("boston", con, index=False, if_exists="replace")

In [43]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [44]:
pd.read_sql(
    """
    SELECT count(*) FROM boston
    """,
    con,
)

   count(*)
0       506

1. Выведите количество пустых значений по каждой из колонок (название колонки, кол-во пустых значений)

In [45]:
pd.read_sql(
    """
    SELECT distinct 'CRIM' as 'col_name', sum(CRIM IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'ZN' as 'col_name', sum(ZN IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'INDUS' as 'col_name', sum(INDUS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'CHAS' as 'col_name', sum(CHAS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'NOX' as 'col_name', sum(NOX IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'RM' as 'col_name', sum(RM IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'AGE' as 'col_name', sum(AGE IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'DIS' as 'col_name', sum(DIS IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'RAD' as 'col_name', sum(RAD IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'TAX' as 'col_name', sum(TAX IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'PTRATIO' as 'col_name', sum(PTRATIO IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'B' as 'col_name', sum(B IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'LSTAT' as 'col_name', sum(LSTAT IS Null) OVER () as 'nulls' FROM boston
    union all
    SELECT distinct 'MEDV' as 'col_name', sum(MEDV IS Null) OVER () as 'nulls' FROM boston
    """,
    con,
)

   col_name  nulls
0      CRIM      0
1        ZN      0
2     INDUS      0
3      CHAS      0
4       NOX      0
5        RM      0
6       AGE      0
7       DIS      0
8       RAD      0
9       TAX      0
10  PTRATIO      0
11        B      0
12    LSTAT      0
13     MEDV      0

2. Выведите количество уникальных значений по каждой из колонок (название колонки, кол-во уникальных значений)

In [55]:
pd.read_sql(
    """
    SELECT 'CRIM' as 'col_name', count(distinct CRIM) as 'nun' FROM boston
    """,
    con,
)

  col_name  nun
0     CRIM  504

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки).
Напишите какой вывод можно сделать по данным в этих колонках

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки). Напишите какой вывод можно сделать по этим данным.

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [ ]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.